{
    "jobs": [
        {
            "icon": "terminal",
            "jobTitle": "Sr. Lead Front End Software Engineer (Hybrid Designer + Developer) — Remote",
            "companyName": "IBM",
            "addressCityState": "Remote",
            "startDate": "SUMMER 2015",
            "endDate": "SPRING 2023",
            "description": "Lead the design, front-end development, and analytics components of SaaS tools within an Agile environment. Manage CI/CD pipelines to ensure seamless integration and deployment. Align development efforts with client requirements, focusing on creating intuitive interfaces and high-performance frontends. Collaborate with cross-functional teams to exceed user expectations, foster innovation, and meet broader business objectives.",
            "linkText": "More",
            "linkUrl": "",
            "skills": [
                {
                    "name": "JavaScript",
                    "imageName": "javascript"
                },
                {
                    "name": "Angular",
                    "imageName": "angular"
                },
                {
                    "name": "TypeScript",
                    "imageName": "typescript"
                },
                {
                    "name": "Node.js",
                    "imageName": "nodejs",
                    "imageStyles": "height:1.5rem"
                },
                {
                    "name": "GraphQL",
                    "imageName": "graphql"
                },
                {
                    "name": "HTML5",
                    "imageName": "html5"
                },
                {
                    "name": "SCSS",
                    "imageName": "scss"
                },
                {
                    "name": "Figma",
                    "imageName": "figma",
                    "imageStyles": "width:1.3rem"
                },
                {
                    "name": "Github",
                    "imageName": "github"
                }
            ],
            "list": [
                {
                    "item": "Lead UI/UX Design and frontend development in our SaaS product redesign using JavaScript, Angular, Typescript, Node.js, Figma, HTML5, SCSS, Bootstrap, JSON, InVision, MURAL."
                },
                {
                    "item": "Worked in a cross-functional product team with a Product owner, UX/UI designers, QA, back-end and front-end developers."
                },
                {
                    "item": "Strong in CI/CD pipelines; including technologies such as Docker, Jenkins, GitHub and others"
                },
                {
                    "item": "Experience working in a fast paced Agile Environment. Attended daily stand up meetings and involved in the spring planning."
                },
                {
                    "item": "Architecting and developing highly scalable single-page web applications and building server-side integration."
                },
                {
                    "item": "Continued analysis and enhancement of web application performance."
                },
                {
                    "item": "Collaboration with our product managers to define strategic solutions based on our client’s requirements."
                },
                {
                    "item": "Evaluating and improving the performance, durability, and security of applications in production."
                },
                {
                    "item": "Lead our pattern design efforts to ensure UI/UX consistency."
                },
                {
                    "item": "Making Angular architecture decisions, debate them with the team and help ensure that we’re building clean, maintainable, beautiful applications."
                }
            ]
        },
        {
            "icon": "terminal",
            "jobTitle": "University of Pennsylvania Health System Department of Dermatology",
            "companyName": "Programmer Analyst ll",
            "addressCityState": "",
            "startDate": "WINTER 2011",
            "endDate": "SUMMER 2015",
            "description": "Responsible for the full stack (frontend development, application logic, services, data persistence) as well as server setup and maintenance.",
            "linkText": "More",
            "linkUrl": "",
            "skills": [
                {
                    "name": "php",
                    "imageName": "php",
                    "imageStyles": "width:1.8rem;height:1.3rem;"
                },
                {
                    "name": "JavaScript",
                    "imageName": "javascript"
                },
                {
                    "name": "AngularJs",
                    "imageName": "angularjs"
                },
                {
                    "name": "HTML5",
                    "imageName": "html5"
                },
                {
                    "name": "SCSS",
                    "imageName": "scss"
                },
                {
                    "name": "jQuery",
                    "imageName": "jquery",
                    "imageStyles": "width: auto;height: 1rem;"
                },
                {
                    "name": "Photoshop",
                    "imageName": "photoshop"
                },
                {
                    "name": "Illustrator",
                    "imageName": "illustrator"
                },
                {
                    "name": "Github",
                    "imageName": "github"
                }
            ],
            "list": [
                {
                    "item": "Implemented Bootstrap framework to create powerful web pages that support multiple browsers and mobile devices."
                },
                {
                    "item": "Analyze user requests to determine parameters of required programs and if a new program must be created, or if an existing program can be modified."
                },
                {
                    "item": "Develop data flow diagrams to analyze data flow through organizations, process descriptions, and user documentation."
                },
                {
                    "item": "Apply the principles of Object-Oriented Programming to design, develop, and implement the application."
                }
            ]
        },
        {
            "icon": "terminal",
            "jobTitle": "Web Developer",
            "companyName": "AMI Entertainment Network, LLC",
            "addressCityState": "",
            "startDate": "SPRING 2011",
            "endDate": "WINTER 2011",
            "description": "Worked as an integral part of a cohesive team by solving problems and building innovative web solutions from open source software. Participated in all stages of design, development, testing, implementation, and maintenance.",
            "linkText": "More",
            "linkUrl": "",
            "skills": [
                {
                    "name": "php",
                    "imageName": "php",
                    "imageStyles": "width:1.8rem;height:1.3rem;"
                },
                {
                    "name": "Wordpress",
                    "imageName": "wordpress"
                },
                {
                    "name": "JavaScript",
                    "imageName": "javascript"
                },
                {
                    "name": "jQuery",
                    "imageName": "jquery",
                    "imageStyles": "width: auto;height: 1rem;"
                },
                {
                    "name": "HTML5",
                    "imageName": "html5"
                },
                {
                    "name": "CSS3",
                    "imageName": "css3",
                    "imageStyles": "width:1.4rem"
                },
                {
                    "name": "Photoshop",
                    "imageName": "photoshop"
                },
                {
                    "name": "Illustrator",
                    "imageName": "illustrator"
                },
                {
                    "name": "Github",
                    "imageName": "github"
                }
            ],
            "list": [
                {
                    "item": "Designed and implemented websites from initial concept, site architecture, and user interface to finished deliverable."
                },
                {
                    "item": "Coded and implemented WordPress sites from Photoshop layout through HTML/CSS to a custom theme, functions, and plugins."
                },
                {
                    "item": "Created and maintained re-usable code libraries to streamline WordPress development cycle."
                },
                {
                    "item": "Designed interfaces and graphics for presentations and mobile-delivered applications."
                },
                {
                    "item": "Integrated search engine optimization best practices in every website project."
                },
                {
                    "item": "Generated regular reports and deliver insights for stakeholders and executives, using dashboards and custom reports in Google Webmaster Tools and Google Analytics."
                }
            ]
        },
        {
            "icon": "terminal",
            "jobTitle": "Software Developer",
            "companyName": "Lockheed Martin · Internship",
            "addressCityState": "",
            "startDate": "SPRING 2010",
            "endDate": "FALL 2010",
            "description": "Acquired diverse technological skills through collaboration with seasoned engineers. Played a key role in designing, constructing, and testing core platform components. Conducted research to identify solutions for platform requirements and contributed to the development of tools to enhance supportability.",
            "linkText": "More",
            "linkUrl": "",
            "skills": [
                {
                    "name": "JavaScript",
                    "imageName": "javascript"
                },
                {
                    "name": "jQuery",
                    "imageName": "jquery",
                    "imageStyles": "width: auto;height: 1rem;"
                },
                {
                    "name": "HTML5",
                    "imageName": "html5"
                },
                {
                    "name": "CSS3",
                    "imageName": "css3",
                    "imageStyles": "width:1.4rem"
                }
            ],
            "list": [
                {
                    "item": "Learned different technologies by pairing with experienced engineers."
                },
                {
                    "item": "Designed, built and tested the core components of the platform."
                },
                {
                    "item": "Investigated solutions to platform requirements."
                },
                {
                    "item": "Assisted in tool creation to improve supportability."
                }
            ]
        },
        {
            "icon": "terminal",
            "jobTitle": "Web Developer",
            "companyName": "Phil17 · Internship",
            "addressCityState": "",
            "startDate": "SPRING 2009",
            "endDate": "WINTER 2009",
            "description": "Experienced in designing and developing websites using JavaScript, PHP, Photoshop, Illustrator, Dreamweaver, and Flash. Proficient in implementing SEO strategies for improved search engine visibility. Skilled in Social Media Optimization and Marketing on platforms such as Google, Facebook, Twitter, and WordPress.",
            "linkText": "More",
            "linkUrl": "",
            "skills": [
                {
                    "name": "php",
                    "imageName": "php",
                    "imageStyles": "width:1.8rem;height:1.3rem;"
                },
                {
                    "name": "JavaScript",
                    "imageName": "javascript"
                },
                {
                    "name": "jQuery",
                    "imageName": "jquery",
                    "imageStyles": "width: auto;height: 1rem;"
                },
                {
                    "name": "HTML5",
                    "imageName": "html5"
                },
                {
                    "name": "CSS3",
                    "imageName": "css3",
                    "imageStyles": "width:1.4rem"
                }
            ],
            "list": [
                {
                    "item": "Proficiency in web development tools including JavaScript, PHP, Photoshop, Illustrator, Dreamweaver, and Flash."
                },
                {
                    "item": "Practical experience implementing SEO (Search Engine Optimization) strategies to enhance website visibility."
                },
                {
                    "item": "Skills in Social Media Optimization and Marketing (SMO/SMM) on platforms such as Google, Facebook, Twitter, and WordPress."
                },
                {
                    "item": "Hands-on involvement in digital marketing activities to build and strengthen online presence."
                }
            ]
        }
    ]
}